In [17]:
import pandas as pd
import numpy as np
data = {
    'A':[1,2,3],
    'B':[4,np.nan,np.nan],
    'C':[7,np.nan,9],
    'D':[10,11,12]
}
my_df = pd.DataFrame(data)
my_df

   A    B    C   D
0  1  4.0  7.0  10
1  2  NaN  NaN  11
2  3  NaN  9.0  12

In [18]:
my_df.dropna()

   A    B    C   D
0  1  4.0  7.0  10

In [32]:
##Require that many non-NA values. Cannot be combined with how.
my_df.dropna(thresh=2,axis=1)  ##same as axis='columns'

   A    C   D
0  1  7.0  10
1  2  NaN  11
2  3  9.0  12

In [39]:
my_df.dropna(thresh=4,axis='index')

   A    B    C   D
0  1  4.0  7.0  10

In [20]:
my_df.fillna(value=my_df['D'].mean())   ##or any other value we want

   A     B     C   D
0  1   4.0   7.0  10
1  2  11.0  11.0  11
2  3  11.0   9.0  12